# Criação de colunas e operações
***

A criação de colunas e a realização de operações são tarefas essenciais na manipulação e transformação de dados no Pandas. Nesse contexto, o Pandas oferece algumas ferramentas úteis, como os métodos assign, transform e apply, que permitem adicionar novas colunas aos DataFrames e aplicar operações em linhas ou colunas existentes.

### Importação das bibliotecas

In [1]:
import pandas as pd

### Criando  dataframe a partir de uma lista em Python

In [2]:
dados = {'Nome': ['Maria', 'João', 'Ana', 'Joana'],
        'QTD': [25, 32, 28, 55],
        'VALOR': [40, 25, 19, 48],
        'IMC': [18, 40, 28, 50]
        }
 
df = pd.DataFrame(dados)
df.head()

    Nome  QTD  VALOR  IMC
0  Maria   25     40   18
1   João   32     25   40
2    Ana   28     19   28
3  Joana   55     48   50

In [3]:
df['TOTAL'] = df['QTD'] * df['VALOR']

In [4]:
df

    Nome  QTD  VALOR  IMC  TOTAL
0  Maria   25     40   18   1000
1   João   32     25   40    800
2    Ana   28     19   28    532
3  Joana   55     48   50   2640

### Método apply
***
O método apply é usado para aplicar uma função a cada linha ou coluna de um DataFrame. Podemos usar funções definidas por nós mesmos ou funções built-in do Python.

In [5]:
def busca_descricao_IMC(IMC):
    if IMC >= 40:
        return 'Obeso'
    elif IMC >=25 and IMC <40:
        return 'Normal'
    else:
        return 'Baixo peso'

In [6]:
df['descricao_IMC'] = df['IMC'].apply(busca_descricao_IMC)

In [7]:
df

    Nome  QTD  VALOR  IMC  TOTAL descricao_IMC
0  Maria   25     40   18   1000    Baixo peso
1   João   32     25   40    800         Obeso
2    Ana   28     19   28    532        Normal
3  Joana   55     48   50   2640         Obeso